{
  "quotes": [
    {
      "text": "You’ve made it this far. Keep up the great work!",
      "author": "Anonymous",
      "level": "good"
    },
    {
      "text": "Every day, in every way, you’re getting better and better.",
      "author": "Émile Coué",
      "level": "good"
    },
    {
      "text": "Celebrate your progress, no matter how small.",
      "author": "Anonymous",
      "level": "good"
    },
    {
      "text": "Success is the sum of small efforts, repeated day in and day out.",
      "author": "Robert Collier",
      "level": "good"
    },
    {
      "text": "The only way to achieve the impossible is to believe it is possible.",
      "author": "Charles Kingsleigh",
      "level": "good"
    },
    {
      "text": "Your hard work is paying off. Keep going!",
      "author": "Anonymous",
      "level": "good"
    },
    {
      "text": "You are capable of amazing things.",
      "author": "Anonymous",
      "level": "good"
    },
    {
      "text": "The future belongs to those who believe in the beauty of their dreams.",
      "author": "Eleanor Roosevelt",
      "level": "good"
    },
    {
      "text": "Success is not final, failure is not fatal: It is the courage to continue that counts.",
      "author": "Winston Churchill",
      "level": "good"
    },
    {
      "text": "Your efforts are appreciated. Keep shining!",
      "author": "Anonymous",
      "level": "good"
    },
    {
      "text": "Life is not about waiting for the storm to pass but about learning to dance in the rain.",
      "author": "Vivian Greene",
      "level": "mid"
    },
    {
      "text": "Do not be discouraged by your failures. Learn from them and keep moving forward.",
      "author": "Anonymous",
      "level": "mid"
    },
    {
      "text": "The only way out is through.",
      "author": "Robert Frost",
      "level": "mid"
    },
    {
      "text": "You are never too old to set another goal or to dream a new dream.",
      "author": "C.S. Lewis",
      "level": "mid"
    },
    {
      "text": "It’s not whether you get knocked down; it’s whether you get up.",
      "author": "Vince Lombardi",
      "level": "mid"
    },
    {
      "text": "It’s never too late to be what you might have been.",
      "author": "George Eliot",
      "level": "mid"
    },
    {
      "text": "Courage doesn’t always roar. Sometimes courage is the quiet voice at the end of the day saying, ‘I will try again tomorrow.’",
      "author": "Mary Anne Radmacher",
      "level": "mid"
    },
    {
      "text": "When you feel like quitting, think about why you started.",
      "author": "Anonymous",
      "level": "mid"
    },
    {
      "text": "You are stronger than you know. Never underestimate your power to heal and grow.",
      "author": "Anonymous",
      "level": "mid"
    },
    {
      "text": "The struggle you’re in today is developing the strength you need for tomorrow.",
      "author": "Robert Tew",
      "level": "mid"
    },
    {
      "text": "When everything seems to be going wrong, remember that airplanes take off against the wind, not with it.",
      "author": "Henry Ford",
      "level": "bad"
    },
    {
      "text": "It’s okay to be a glowstick: sometimes we need to break before we shine.",
      "author": "Anonymous",
      "level": "bad"
    },
    {
      "text": "The only thing we have to fear is fear itself.",
      "author": "Franklin D. Roosevelt",
      "level": "bad"
    },
    {
      "text": "The greatest glory in living lies not in never falling, but in rising every time we fall.",
      "author": "Nelson Mandela",
      "level": "bad"
    },
    {
      "text": "Tough times never last, but tough people do.",
      "author": "Robert H. Schuller",
      "level": "bad"
    },
    {
      "text": "There is no despair so absolute as that which comes with the first moments of our first great sorrow, when we have not yet known what it is to have suffered and be healed, to have despaired and have recovered hope.",
      "author": "George Eliot",
      "level": "bad"
    },
    {
      "text": "Healing takes courage, and we all have courage, even if we have to dig a little to find it.",
      "author": "Tori Amos",
      "level": "bad"
    },
    {
      "text": "The human capacity for burden is like bamboo—far more flexible than you’d ever believe at first glance.",
      "author": "Jodi Picoult",
      "level": "bad"
    },
    {
      "text": "The bravest thing I ever did was continuing my life when I wanted to die.",
      "author": "Juliette Lewis",
      "level": "bad"
    },
    {
      "text": "Just when the caterpillar thought the world was over, it became a butterfly.",
      "author": "Anonymous",
      "level": "bad"
    },
    {
      "text": "You may encounter many defeats, but you must not be defeated.",
      "author": "Maya Angelou",
      "level": "bad"
    }
  ]
}
